```mermaid
classDiagram
    class Пользователь {
        +ID : string
        +имя : string
        +телефон : string
        +email : string
        +дата_регистрации : date
        +способ_авторизации : string
    }
    class Питомец {
        +ID : string
        +вид : string
        +порода : string
        +дата_рождения : date
        +вес : float
        +особенности_здоровья : string
    }
    class УчетнаяЗапись {
        +способ_входа : string
        +дата_создания : date
    }
    class БонусныйСчет {
        +баланс_баллов : int
        +статус_участника : string
    }
    class Товар {
        +ID : string
        +название : string
        +описание : string
        +состав : string
        +цена : float
        +фото : string
        +фасовка : string
        +наличие : bool
    }
    class КатегорияТовара {
        +ID : string
        +название : string
        +вид_животного : string
        +назначение : string
    }
    class Корзина {
        +итоговая_сумма : float
        +промокод : string
    }
    class Заказ {
        +номер : string
        +статус : string
        +дата : date
        +сумма : float
    }
    class ПозицияЗаказа {
        +количество : int
        +вариант_фасовки : string
        +цена_на_момент_заказа : float
    }
    class Платеж {
        +сумма : float
        +способ_оплаты : string
        +статус : string
        +дата : date
    }
    class Доставка {
        +способ_получения : string
        +адрес_или_точка : string
        +время : datetime
        +статус : string
    }
    class ЗоомагазинПВЗ {
        +ID : string
        +адрес : string
        +тип : string
    }
    class Промокод {
        +код : string
        +скидка : float
        +срок_действия : date
    }
    class Отзыв {
        +оценка : int
        +текст : string
        +дата : date
    }
    class PushУведомление {
        +текст : string
        +тип : string
        +дата_отправки : datetime
    }

    Пользователь "1" --> "0..*" Питомец : владеет
    Пользователь "1" --> "1" УчетнаяЗапись : имеет
    Пользователь "1" --> "1" Корзина : имеет
    Пользователь "1" --> "0..*" Заказ : оформляет
    Пользователь "1" --> "1" БонусныйСчет : имеет
    Пользователь "1" --> "0..*" Отзыв : оставляет
    Пользователь "1" --> "0..*" PushУведомление : получает

    Заказ "1" --> "1..*" ПозицияЗаказа : "состоит из"
    Заказ "1" --> "1" Платеж : оплачивается
    Заказ "1" --> "1" Доставка : доставляется
    Заказ "0..*" --> "0..1" Промокод : использует

    ПозицияЗаказа "0..*" --> "1" Товар : ссылается
    Товар "0..*" --> "1" КатегорияТовара : относится
    Товар "0..*" --> "0..*" ЗоомагазинПВЗ : "в наличии"
    Корзина "0..*" --> "0..*" Товар : содержит
